Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བགྱི་ཞིང་བསྙེན་བཀུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀུན་ཀྱང་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ། གཟུངས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པ་དེ་དག་བལྟ་བའི་སླད་དུ་མཆིའོ།
en: Then the bodhisattva great being Samantaraśmi said to that blessed one, the tathāgata Ratnākara, “Blessed Lord, I too will go to that world system of Patient Endurance to behold the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, to pay homage and respect to him, and indeed to see all those bodhisattva great beings, most of whom are youthful ones, have acquired dhāraṇī and exact knowledge, and have mastered all the meditative stabilities and meditative absorptions.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །
en: That blessed one, the tathāgata Ratnākara, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བ་ལ་པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ།
en: The tathāgata Ratnākara gave the bodhisattva great being Samantaraśmi a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son!

source: སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ་ཞེས་ཀྱང་གྱིས་ལ་པད་མོ་འདི་དག་གིས་གཏོར་ཅིག །
en: You should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Ratnākara, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བག་ཡོད་པར་སྤྱོད་ཅིག །
en: Noble son, you should conduct yourself with care in that buddhafield.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་མགུ་བར་དཀའ་བ་ཡིན་གྱིས།
en: If you ask why, it is because bodhisattva great beings who are born in that world system are hard to satisfy.

source: དེར་ཉམས་པར་གྱུར་ཏ་རེ།
en: Beware of harm there.” {

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འབྱུང་གནས་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: Dt.14} Then the bodhisattva great being Samantaraśmi received from that blessed one, the tathāgata, arhat, completely awakened Buddha Ratnākara those golden thousand-petaled lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་དང་། ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་འགྲོགས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས།
en: Accompanied by many hundred billion trillions of bodhisattvas in the form of householders, mendicants, young men, and young women, he vanished from that buddhafield.

source: ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ། མེ་ཏོག་དང་། སྤོས་དང་། བདུག་སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། རྒྱན་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the eastern direction, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni resided.

source: མཆོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Arriving there, he bowed his head toward the feet of the Blessed One and took a place to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འབྱུང་གནས། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེ་འམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ།
en: Having taken a place to one side, the bodhisattva great being Samantaraśmi then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Ratnākara, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”

source: པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་པད་མོ་དེ་དག་བཞེས་ནས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses and scattered them in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །དེ་ནས་པད་མོ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །པད་མོ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མང་པོ་བཞུགས་ཤིང་། འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་ཉིད་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ།
en: The lotuses fully covered all those world systems, and upon those lotuses many bodies of the tathāgatas were seated, teaching this very doctrine, from the six perfections onward.

source: །ཆོས་བསྟན་པ་དེ་སེམས་ཅན་གང་གིས་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་དང་།
en: All beings who heard that teaching of the Dharma became assured of reaching unsurpassed, complete enlightenment.

source: ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་དེ་དག་གིས་ཀྱང་། རང་རང་གི་དགེ་བའི་རྩ་བས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་རིམ་གྲོར་བྱས་སོ། །བཀུར་སྟིར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ།
en: Those bodhisattvas in the form of householders, mendicants, young men, and young women also served, venerated, honored, and worshiped the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, through the roots of their respective virtuous actions, and took places to one side. {

source: །མཆོད་པ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་ལྷོ་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་ཡོད་དོ།
en: Dt.15} Beyond all the world systems in the southern direction, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Sarva­śokāpagata.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resides and lives the tathāgata, arhat, completely awakened buddha called Aśokaśrī, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་པའི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Vigataśoka who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Aśokaśrī was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Going there, he asked that blessed one, the tathāgata Aśokaśrī, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་བྱང་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Aśokaśrī, replied to the bodhisattva great being Vigataśoka, “Noble son, north from here, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: །དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་ཏེ།
en: He teaches the perfection of wisdom to bodhisattva great beings.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར།
en: Such is his power.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས།
en: That blessed one, the tathāgata Aśokaśrī, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་པ་ལ་པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེ་འམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ་པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ།
en: The tathāgata Aśokaśrī gave the bodhisattva great being Vigataśoka a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son, you should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Aśokaśrī, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: །ཞེས་གྱིས་ལ་པད་མོ་འདི་དག་གིས་གཏོར་ཅིག །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བག་ཡོད་པར་སྤྱོད་ཅིག །
en: Noble son, you should conduct yourself with care in that buddhafield.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་པའི་དཔལ་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: Then the bodhisattva great being Vigataśoka received from that blessed one, the tathāgata, arhat, completely awakened Buddha Aśokaśrī, those golden-colored, thousand-petaled lotuses.

source: ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ། མེ་ཏོག་དང་སྤོས་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་རྒྱན་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་མཆོད་པ་བྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the southern direction, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni resided.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Arriving there, he bowed his head toward the feet of the Blessed One and took a place to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་པའི་དཔལ། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ།
en: Having taken a place to one side, the bodhisattva great being Vigataśoka then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Aśokaśrī, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”

source: པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་པད་མོ་དེ་དག་བཞེས་ནས། ལྷོ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses and scattered them in the world systems of the southern direction, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །དེ་ནས་པད་མོ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏེ། པད་མོ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མང་པོ་བཞུགས་ཤིང་། འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་ཉིད་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ།
en: The lotuses fully covered all those world systems, and upon them many bodies of the tathāgatas were seated, teaching this very doctrine from the six perfections onward.

source: །ཆོས་བསྟན་པ་དེ་སེམས་ཅན་གང་གིས་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་དང་།
en: All beings who heard that teaching of the Dharma became assured of reaching unsurpassed, complete enlightenment.

source: ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་དེ་དག་གིས་ཀྱང་རང་རང་གི་དགེ་བའི་རྩ་བས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་རིམ་གྲོར་བྱས་སོ། །བཀུར་སྟིར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ། །མཆོད་པ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Those bodhisattvas in the form of householders, mendicants, young men, and young women also served, venerated, honored, and worshiped the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, with the roots of their respective virtuous actions, and then took places to one side.

source: །དེ་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Beyond all the world systems in the western direction, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Upaśāntā.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resides and lives the tathāgata, arhat, completely awakened buddha called Ratnārcis, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Cāritramati who, on beholding that great light, the trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Ratnārcis, was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Going there, he asked that blessed one, the tathāgata Ratnārcis, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: བཅོམ་ལྡན་འདས་རིན་ཆེན་འོད་འཕྲོས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Ratnārcis, replied to the bodhisattva great being Cāritramati, “Noble son, east from here, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ།
en: Such is his power.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་ཀྱིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་བལྟ་བ་དང་དེ་ལ་ཕྱག་བགྱི་ཞིང་བསྙེན་བཀུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀུན་ཀྱང་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ། གཟུངས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པ་དེ་དག་བལྟ་བའི་སླད་དུ་མཆིའོ།
en: Then the bodhisattva great being Cāritramati said to that blessed one, the tathāgata Ratnārcis, “Blessed Lord, I too will go to that world system of Patient Endurance to behold the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, to pay homage and respect to him, and indeed to see all those bodhisattva great beings, most of whom are youthful ones, have acquired dhāraṇī and exact knowledge, and have mastered all the meditative stabilities and meditative absorptions.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་ལ།
en: That blessed one, the tathāgata Ratnārcis, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་སྙུན་མི་མངའ་འམ། །གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེ་འམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ་ཞེས་ཀྱང་གྱིས་ལ།
en: The tathāgata Ratnārcis gave the bodhisattva great being Cāritramati a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son, you should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Ratnārcis, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: པད་མོ་འདི་དག་གིས་གཏོར་ཅིག །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བག་ཡོད་པར་སྤྱོད་ཅིག །
en: Noble son, you should conduct yourself with care in that buddhafield.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་ཀྱིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: Then the bodhisattva great being Cāritramati received from that blessed one, the tathāgata, arhat, completely awakened Buddha Ratnārcis, those golden-colored, thousand-petaled lotuses.

source: ནུབ་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ་མེ་ཏོག་དང་སྤོས་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་ན་བཟའ་དང་རྒྱན་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the western direction, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni resided.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་ཀྱིས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Arriving there, he bowed his head toward the feet of the Blessed One and took a place to one side.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་།
en: Having taken a place to one side, the bodhisattva great being Cāritramati then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Ratnārcis, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”
